[
  {
    "id": 1,
    "name": "The 2 Dollar Gourmet Burger | But Cheaper",
    "description": "A mouthwatering homemade burger that rivals restaurant quality at a fraction of the cost. Made with perfectly seasoned beef patties, umami-rich soy sauce, and fresh toppings, this burger delivers gourmet flavor without breaking the bank.",
    "ingredients": [
      "Beef",
      "Soy sauce",
      "Vinegar",
      "Garlic",
      "Pepper",
      "Burger buns",
      "Lettuce",
      "Tomato",
      "Onion",
      "Mayonnaise",
      "Cheese"
    ],
    "calories": 500,
    "carbs": 30,
    "fats": 20,
    "proteins": 40,
    "rating": 4.2,
    "url": "https://i.ytimg.com/vi/IJou15msogM/maxresdefault.jpg",
    "instructions": [
      "Mix ground beef with soy sauce, minced garlic, and black pepper",
      "Form into 1/4 pound patties, making a small dimple in the center",
      "Heat pan or grill to medium-high heat",
      "Cook patties for 4-5 minutes each side for medium doneness",
      "Toast the burger buns until golden",
      "Layer with lettuce, tomato, onion, and cheese",
      "Add mayonnaise and assemble the burger"
    ]
  },
  {
    "name": "Creamy Cajun Pasta",
    "description": "A delicious and flavorful creamy Cajun pasta dish that is quick and easy to make at home. This recipe features juicy seasoned chicken breast served with a creamy Cajun sauce over pasta.",
    "author": "Unknown",
    "ingredients": [
      "8 oz pasta",
      "2 chicken breasts",
      "Salt",
      "Oil",
      "Cajun seasoning",
      "Onion powder",
      "Garlic powder",
      "Dry parsley",
      "Paprika",
      "Old Bay seasoning",
      "3-4 tbsp butter",
      "1 onion, chopped",
      "1 red bell pepper, chopped",
      "2 tomatoes, diced",
      "1 cup heavy cream",
      "1 cup chicken broth",
      "4 oz cream cheese",
      "1 tsp chicken bouillon",
      "Pepper",
      "Parmesan cheese"
    ],
    "instructions": [
      "Step 1: Boil the pasta in salted water until al dente, then drain and set aside.",
      "Step 2: Flatten the chicken breasts in a Ziploc bag using a meat tenderizer. Season with oil, Cajun seasoning, onion powder, garlic powder, dry parsley, paprika, and Old Bay seasoning. Rub the seasoning into the chicken breasts.",
      "Step 3: Cook the seasoned chicken breasts in a hot skillet with oil for 5-10 minutes on each side until cooked through. Remove and set aside.",
      "Step 4: In the same skillet, melt butter and sauté chopped onion, red bell pepper, and diced tomatoes until softened. Add heavy cream, chicken broth, cream cheese, chicken bouillon, Cajun seasoning, pepper, and salt to taste. Stir until well combined.",
      "Step 5: Add the cooked pasta to the creamy Cajun sauce, ensuring it is well coated. Cut the cooked chicken breasts into bite-sized pieces and add them to the pasta. Mix well.",
      "Step 6: Serve the creamy Cajun pasta topped with Parmesan cheese. Enjoy!"
    ],
    "servings": 4,
    "calories": 620,
    "carbs": 42,
    "fats": 36,
    "proteins": 32,
    "url": "https://i.ytimg.com/vi/hblIsx6K4UI/maxresdefault.jpg",
    "authorIcon": {
      "initials": "U",
      "backgroundColor": "#FF5733"
    },
    "id": 2
  },
  {
    "name": "Perfect Pan-Seared Steak with Butter Basting",
    "description": "A simple yet delicious steak recipe that guarantees to impress with a crispy crust and juicy interior.",
    "ingredients": [
      "1 thick steak (1.5 to 2 inches thick) - recommended cuts: rib eye, T-bone, sirloin, strip",
      "Kosher salt",
      "Fresh cracked black pepper",
      "2 tablespoons high smoke point oil",
      "4 tablespoons unsalted butter",
      "2 cloves garlic, lightly crushed",
      "1 bunch fresh thyme"
    ],
    "instructions": [
      "Step 1: Let the steak come up to room temperature. Pat it dry with a paper towel and season generously with kosher salt and fresh cracked black pepper.",
      "Step 2: Heat a medium to large skillet over medium-high heat with 2 tablespoons of high smoke point oil.",
      "Step 3: Once the pan is hot, add the steak. Sear for 2-3 minutes on each side for medium-rare.",
      "Step 4: When flipping the steak, add unsalted butter, crushed garlic, and fresh thyme to the pan. Baste the steak with the melted butter for about a minute.",
      "Step 5: Check the internal temperature of the steak. For medium-rare, aim for 135°F. Remove the steak from the pan and let it rest for 5-8 minutes before slicing.",
      "Step 6: Serve the steak with the buttery juices poured on top. Enjoy!"
    ],
    "servings": 1,
    "calories": 800,
    "carbs": 2,
    "fats": 70,
    "proteins": 45,
    "url": "https://i.ytimg.com/vi/SdHE2zgSaxU/maxresdefault.jpg",
    "id": 3
  },
  {
    "name": "Perfect Pan-Seared Steak",
    "description": "Learn how to make the perfect pan-seared steak using a simple technique that ensures a juicy and flavorful result every time.",
    "ingredients": [
      "1 1 1/2 to 2-inch thick steak (ribeye, T-bone, sirloin, strip)",
      "Kosher salt",
      "Fresh cracked black pepper",
      "2 tbsp high smoke point oil",
      "4 tbsp unsalted butter",
      "2 cloves garlic, lightly crushed",
      "1 bunch fresh thyme"
    ],
    "instructions": [
      "Step 1: Let the steak come up to room temperature before cooking.",
      "Step 2: Heat a medium to large-sized skillet over medium-high heat with 2 tbsp of oil.",
      "Step 3: Pat the steak dry with a paper towel, season generously with salt and pepper.",
      "Step 4: Once the pan is hot, sear the steak for 2-3 minutes on each side for medium-rare.",
      "Step 5: When flipping the steak, add butter, garlic, and thyme to the pan. Baste the steak with the melted butter for about a minute until desired doneness is reached.",
      "Step 6: Check the internal temperature of the steak (135°F for medium-rare), then remove from the pan and let it rest for 5-8 minutes before slicing and serving."
    ],
    "servings": 1,
    "calories": 800,
    "carbs": 2,
    "fats": 65,
    "proteins": 50,
    "url": "https://i.ytimg.com/vi/SdHE2zgSaxU/maxresdefault.jpg",
    "id": 4
  },
  {
    "name": "Perfect Pan-Seared Steak",
    "description": "Learn how to make the perfect pan-seared steak using a simple technique that yields a beautifully browned crust and juicy interior.",
    "ingredients": [
      "1 thick steak (1.5-2 inches thick) - recommended cuts: ribeye, T-bone, sirloin, strip",
      "Kosher salt",
      "Fresh cracked black pepper",
      "2 tbsp high smoke point oil",
      "4 tbsp unsalted butter",
      "2 cloves garlic, lightly crushed",
      "1 bunch fresh thyme"
    ],
    "instructions": [
      "Step 1: Let the steak come up to room temperature before cooking.",
      "Step 2: Heat a medium to large skillet over medium-high heat with 2 tbsp of oil.",
      "Step 3: Pat the steak dry with a paper towel, season generously with salt and pepper.",
      "Step 4: Sear the steak for 2-3 minutes on each side for medium-rare.",
      "Step 5: Add butter, garlic, and thyme to the pan. Baste the steak with the butter for about a minute until desired doneness is reached.",
      "Step 6: Check the internal temperature of the steak (medium-rare is 135°F), then remove from the pan and let it rest for 5-8 minutes before slicing."
    ],
    "servings": 1,
    "calories": 800,
    "carbs": 2,
    "fats": 70,
    "proteins": 45,
    "url": "https://i.ytimg.com/vi/SdHE2zgSaxU/maxresdefault.jpg",
    "id": 5
  },
  {
    "name": "The Perfect Steak",
    "description": "A simple yet delicious recipe for cooking the perfect steak at home, using affordable ingredients and techniques.",
    "author": "But Cheaper",
    "ingredients": [
      "1 (12-ounce) ribeye or sirloin steak (1.5 inches thick)",
      "1 tablespoon kosher salt",
      "1 teaspoon freshly ground black pepper",
      "1 tablespoon vegetable oil or high-smoke-point oil",
      "2 tablespoons unsalted butter",
      "2 garlic cloves, smashed",
      "2 sprigs fresh thyme or rosemary"
    ],
    "instructions": [
      "Step 1: Remove the steak from the refrigerator and let it sit at room temperature for 30-45 minutes. Pat it dry with paper towels to remove excess moisture.",
      "Step 2: Season the steak generously on both sides with kosher salt and freshly ground black pepper. Press the seasoning into the meat to ensure it sticks.",
      "Step 3: Heat a heavy skillet (preferably cast iron) over medium-high heat. Add the vegetable oil and let it heat until it shimmers but does not smoke.",
      "Step 4: Place the steak in the skillet and sear for 3-4 minutes on the first side without moving it. Flip the steak and sear the other side for another 3-4 minutes.",
      "Step 5: Reduce the heat to medium. Add the butter, smashed garlic cloves, and fresh thyme or rosemary to the skillet. Tilt the skillet slightly and spoon the melted butter over the steak continuously for 1-2 minutes to baste it.",
      "Step 6: Check the internal temperature of the steak using a meat thermometer. For medium-rare, aim for 130-135°F (54-57°C). Adjust cooking time as needed.",
      "Step 7: Remove the steak from the skillet and let it rest on a cutting board or plate for 5-10 minutes. This allows the juices to redistribute throughout the meat.",
      "Step 8: Slice the steak against the grain and serve immediately. Optionally, drizzle with any remaining pan juices for extra flavor."
    ],
    "servings": 2,
    "calories": 550,
    "carbs": 1,
    "fats": 45,
    "proteins": 35,
    "Time": "30 minutes",
    "url": "https://i.ytimg.com/vi/cWNpW-vV5tQ/maxresdefault.jpg",
    "id": 6
  },
  {
    "name": "Sous Vide Steak",
    "description": "A perfectly cooked steak using the sous vide method, ensuring even doneness and maximum juiciness.",
    "author": "Babish (Andrew Rea)",
    "ingredients": [
      "2 (8-ounce) ribeye steaks, about 1.5 inches thick",
      "1 tablespoon kosher salt",
      "1 teaspoon freshly ground black pepper",
      "2 tablespoons unsalted butter",
      "2 sprigs fresh thyme",
      "2 cloves garlic, crushed",
      "1 tablespoon olive oil"
    ],
    "instructions": [
      "Step 1: Preheat the sous vide water bath to 130°F (54°C) for medium-rare doneness. Adjust temperature based on your preferred doneness.",
      "Step 2: Season the steaks generously with kosher salt and freshly ground black pepper on both sides.",
      "Step 3: Place each steak in a vacuum-sealable bag or a zip-top bag using the water displacement method. Add 1 tablespoon of butter, 1 sprig of thyme, and 1 crushed garlic clove to each bag.",
      "Step 4: Submerge the bags in the preheated water bath, ensuring they are fully immersed. Cook for 1 to 2 hours for medium-rare.",
      "Step 5: After cooking, remove the steaks from the bags and pat them dry with paper towels. Heat a cast-iron skillet over high heat and add 1 tablespoon of olive oil.",
      "Step 6: Sear the steaks for 1-2 minutes per side until a golden-brown crust forms. Baste with the remaining butter, thyme, and garlic during the sear for extra flavor.",
      "Step 7: Let the steaks rest for 5 minutes before slicing. Serve immediately and enjoy!"
    ],
    "servings": 2,
    "calories": 650,
    "carbs": 2,
    "fats": 50,
    "proteins": 55,
    "Time": "2 hours (including sous vide cooking time)",
    "url": "https://i.ytimg.com/vi/NCHOyqMUj4o/maxresdefault.jpg",
    "id": 7
  },
  {
    "name": "Whole Pork Loin",
    "description": "A classic and versatile dish featuring a whole pork loin, seasoned and roasted to perfection. Perfect for a hearty meal or special occasion.",
    "author": "Babish (Andrew Rea)",
    "ingredients": [
      "1 whole pork loin (about 4-5 pounds)",
      "2 tablespoons olive oil",
      "2 tablespoons kosher salt",
      "1 tablespoon black pepper",
      "1 tablespoon garlic powder",
      "1 tablespoon onion powder",
      "1 tablespoon smoked paprika",
      "1 teaspoon dried thyme",
      "1 teaspoon dried rosemary",
      "1 teaspoon dried oregano"
    ],
    "instructions": [
      "Step 1: Preheat your oven to 375°F (190°C). Pat the pork loin dry with paper towels to ensure a good sear.",
      "Step 2: In a small bowl, mix together the kosher salt, black pepper, garlic powder, onion powder, smoked paprika, thyme, rosemary, and oregano to create a dry rub.",
      "Step 3: Rub the pork loin generously with olive oil, then evenly coat it with the dry rub mixture, pressing the spices into the meat.",
      "Step 4: Heat a large oven-safe skillet or roasting pan over medium-high heat. Sear the pork loin on all sides until golden brown, about 2-3 minutes per side.",
      "Step 5: Transfer the skillet or pan to the preheated oven. Roast the pork loin for about 25-30 minutes, or until the internal temperature reaches 145°F (63°C) when measured with a meat thermometer.",
      "Step 6: Remove the pork loin from the oven and let it rest for 10-15 minutes before slicing. This allows the juices to redistribute throughout the meat.",
      "Step 7: Slice the pork loin into 1/2-inch thick pieces and serve warm. Pair with your favorite sides like roasted vegetables or mashed potatoes."
    ],
    "servings": 8,
    "calories": 320,
    "carbs": 2,
    "fats": 18,
    "proteins": 36,
    "Time": "1 hour",
    "url": "https://i.ytimg.com/vi/AgFaljoriYA/maxresdefault.jpg",
    "id": 8
  },
  {
    "name": "Simple Pork Chops with Pan Sauce",
    "description": "Juicy pork chops seared to perfection and served with a flavorful pan sauce made from pan drippings, garlic, and herbs.",
    "author": "Chef John",
    "ingredients": [
      "4 bone-in pork chops (about 1 inch thick)",
      "1 teaspoon salt",
      "1/2 teaspoon black pepper",
      "1 tablespoon olive oil",
      "2 tablespoons unsalted butter",
      "3 cloves garlic, minced",
      "1/2 cup chicken broth",
      "1/4 cup white wine (optional)",
      "1 teaspoon fresh thyme leaves",
      "1 teaspoon fresh rosemary, chopped"
    ],
    "instructions": [
      "Step 1: Season the pork chops generously on both sides with salt and black pepper.",
      "Step 2: Heat olive oil in a large skillet over medium-high heat. Once hot, add the pork chops and sear for 4-5 minutes on each side, or until golden brown and cooked through. Remove the pork chops from the skillet and set aside on a plate.",
      "Step 3: Reduce the heat to medium and add butter to the skillet. Once melted, add minced garlic and sauté for 1 minute until fragrant.",
      "Step 4: Pour in the chicken broth and white wine (if using), scraping the bottom of the skillet to release any browned bits. Add thyme and rosemary, and let the sauce simmer for 2-3 minutes until slightly reduced.",
      "Step 5: Return the pork chops to the skillet, spooning the sauce over them. Cook for an additional 1-2 minutes to reheat the pork chops and coat them in the sauce.",
      "Step 6: Remove from heat and let the pork chops rest for 2-3 minutes before serving. Serve with the pan sauce drizzled over the top."
    ],
    "servings": 4,
    "calories": 320,
    "carbs": 2,
    "fats": 18,
    "proteins": 35,
    "Time": "30 minutes",
    "url": "https://i.ytimg.com/vi/5pV_LosNT1U/maxresdefault.jpg",
    "id": 9
  },
  {
    "name": "Acai Bowl",
    "description": "A refreshing and healthy breakfast or snack made with acai berries, topped with fresh fruits, granola, and honey.",
    "author": "Unknown (Common recipe)",
    "ingredients": [
      "2 packs (100g each) frozen unsweetened acai puree",
      "1 frozen banana, sliced",
      "1/2 cup frozen mixed berries (strawberries, blueberries, raspberries)",
      "1/2 cup almond milk (or any milk of choice)",
      "1 tablespoon honey (optional, for sweetness)",
      "1/4 cup granola",
      "1/4 cup fresh sliced strawberries",
      "1/4 cup fresh blueberries",
      "1 tablespoon chia seeds",
      "1 tablespoon shredded coconut (optional)"
    ],
    "instructions": [
      "Step 1: Break the frozen acai puree packs into smaller pieces and place them in a blender.",
      "Step 2: Add the frozen banana slices, frozen mixed berries, and almond milk to the blender. Blend on high until smooth and creamy. If the mixture is too thick, add a splash more almond milk.",
      "Step 3: Pour the blended acai mixture into a bowl. Use a spoon to smooth the top into an even layer.",
      "Step 4: Arrange the fresh sliced strawberries, blueberries, granola, chia seeds, and shredded coconut on top of the acai mixture in a decorative pattern.",
      "Step 5: Drizzle honey over the top for added sweetness, if desired. Serve immediately with a spoon and enjoy!"
    ],
    "servings": 1,
    "calories": 350,
    "carbs": 55,
    "fats": 12,
    "proteins": 6,
    "Time": "10 minutes",
    "url": "https://i.ytimg.com/vi/5g7rJ7ImcqI/maxresdefault.jpg",
    "id": 10
  },
  {
    "name": "Acai Bowl",
    "description": "A refreshing and healthy breakfast or snack made with acai berries, topped with fresh fruits, granola, and other delicious toppings.",
    "author": "Unknown (Common recipe)",
    "ingredients": [
      "2 packs (100g each) frozen unsweetened acai puree",
      "1 frozen banana, sliced",
      "1/2 cup frozen mixed berries (strawberries, blueberries, raspberries)",
      "1/2 cup unsweetened almond milk (or any milk of choice)",
      "1 tablespoon honey or maple syrup (optional, for sweetness)",
      "1/2 cup granola",
      "1/4 cup fresh banana slices",
      "1/4 cup fresh strawberries, sliced",
      "1 tablespoon chia seeds",
      "1 tablespoon shredded coconut (optional)"
    ],
    "instructions": [
      "Step 1: Break the frozen acai puree packs into smaller pieces and place them in a blender.",
      "Step 2: Add the frozen banana slices, frozen mixed berries, and almond milk to the blender. Blend on high until smooth and creamy. If the mixture is too thick, add a splash more almond milk.",
      "Step 3: Taste the mixture and add honey or maple syrup if desired for extra sweetness. Blend again briefly to combine.",
      "Step 4: Pour the blended acai mixture into a bowl. Use a spoon to smooth the top.",
      "Step 5: Top the acai bowl with granola, fresh banana slices, fresh strawberry slices, chia seeds, and shredded coconut (if using). Arrange the toppings evenly for a visually appealing presentation.",
      "Step 6: Serve immediately with a spoon and enjoy your refreshing and nutritious acai bowl!"
    ],
    "servings": 1,
    "calories": 350,
    "carbs": 60,
    "fats": 10,
    "proteins": 6,
    "Time": "10 minutes",
    "url": "https://i.ytimg.com/vi/5g7rJ7ImcqI/maxresdefault.jpg",
    "id": 11
  },
  {
    "name": "Acai Bowl",
    "description": "A refreshing and healthy breakfast or snack made with acai berries, topped with fresh fruits, granola, and honey.",
    "author": "Unknown (Common recipe)",
    "ingredients": [
      "2 packs (100g each) frozen unsweetened acai puree",
      "1 frozen banana, sliced",
      "1/2 cup frozen mixed berries (strawberries, blueberries, raspberries)",
      "1/2 cup almond milk (or any milk of choice)",
      "1/2 cup granola",
      "1/2 cup fresh sliced strawberries",
      "1/2 cup fresh blueberries",
      "1 tablespoon honey",
      "1 tablespoon chia seeds (optional)",
      "1 tablespoon shredded coconut (optional)"
    ],
    "instructions": [
      "Step 1: Break the frozen acai puree packs into smaller pieces and place them in a blender.",
      "Step 2: Add the frozen banana slices, frozen mixed berries, and almond milk to the blender.",
      "Step 3: Blend on high speed until smooth and thick, scraping down the sides as needed. If the mixture is too thick, add a splash more almond milk.",
      "Step 4: Pour the blended acai mixture into a bowl and spread it evenly.",
      "Step 5: Top the acai mixture with granola, fresh sliced strawberries, fresh blueberries, chia seeds, and shredded coconut.",
      "Step 6: Drizzle honey over the top for added sweetness.",
      "Step 7: Serve immediately and enjoy your refreshing and healthy acai bowl!"
    ],
    "servings": 2,
    "calories": 300,
    "carbs": 50,
    "fats": 8,
    "proteins": 5,
    "Time": "10 minutes",
    "url": "https://i.ytimg.com/vi/5g7rJ7ImcqI/maxresdefault.jpg",
    "id": 12
  },
  {
    "name": "Oven Fries — Crispier Than Deep-Fried",
    "description": "Crispy, golden oven fries that are healthier than deep-fried versions but just as delicious. Perfect as a side dish or snack.",
    "author": "Chef John",
    "ingredients": [
      "4 large russet potatoes (about 2 pounds)",
      "3 tablespoons olive oil",
      "1 teaspoon salt",
      "1/2 teaspoon black pepper",
      "1/2 teaspoon paprika",
      "1/2 teaspoon garlic powder"
    ],
    "instructions": [
      "Step 1: Preheat the oven to 450°F (230°C). Place a large baking sheet in the oven to heat up while you prepare the potatoes.",
      "Step 2: Wash and peel the potatoes. Cut them into 1/2-inch thick sticks, ensuring they are as uniform as possible for even cooking.",
      "Step 3: Place the potato sticks in a large bowl and cover them with cold water. Let them soak for at least 30 minutes to remove excess starch, which helps achieve crispiness.",
      "Step 4: Drain the potatoes and pat them dry thoroughly with a clean kitchen towel or paper towels. Dry potatoes are essential for crispiness.",
      "Step 5: In a large bowl, toss the dried potato sticks with olive oil, salt, black pepper, paprika, and garlic powder until evenly coated.",
      "Step 6: Carefully remove the hot baking sheet from the oven and spread the potato sticks in a single layer, ensuring they are not overcrowded.",
      "Step 7: Bake for 20-25 minutes, flipping the fries halfway through, until they are golden brown and crispy.",
      "Step 8: Remove from the oven and let cool for 2-3 minutes before serving. Enjoy with your favorite dipping sauce!"
    ],
    "servings": 4,
    "calories": 220,
    "carbs": 37,
    "fats": 7,
    "proteins": 4,
    "Time": "1 hour",
    "url": "https://i.ytimg.com/vi/m6kcANnAJSo/maxresdefault.jpg",
    "id": 13
  },
  {
    "name": "Classic Spaghetti Carbonara",
    "description": "A traditional Italian pasta dish made with eggs, cheese, pancetta, and black pepper, known for its creamy texture and rich flavor.",
    "author": "Babish (Andrew Rea)",
    "ingredients": [
      "400g spaghetti",
      "200g pancetta, diced",
      "2 large eggs",
      "1 cup grated Pecorino Romano cheese",
      "1 cup grated Parmesan cheese",
      "4 cloves garlic, minced",
      "1 tsp freshly ground black pepper",
      "Salt, to taste",
      "2 tbsp olive oil"
    ],
    "instructions": [
      "Step 1: Bring a large pot of salted water to a boil. Add the spaghetti and cook according to package instructions until al dente. Reserve 1 cup of pasta water, then drain the spaghetti.",
      "Step 2: While the pasta cooks, heat olive oil in a large skillet over medium heat. Add the diced pancetta and cook until crispy, about 5-7 minutes. Add minced garlic and cook for an additional 1-2 minutes until fragrant.",
      "Step 3: In a medium bowl, whisk together the eggs, grated Pecorino Romano, grated Parmesan, and black pepper until well combined.",
      "Step 4: Add the drained spaghetti to the skillet with the pancetta. Toss to coat the pasta in the pancetta fat. Remove the skillet from heat.",
      "Step 5: Quickly pour the egg and cheese mixture over the hot pasta, tossing continuously to create a creamy sauce. If the sauce is too thick, add reserved pasta water, 1 tablespoon at a time, until desired consistency is reached.",
      "Step 6: Serve immediately, garnished with additional grated cheese and black pepper if desired."
    ],
    "servings": 4,
    "calories": 650,
    "carbs": 55,
    "fats": 35,
    "proteins": 30,
    "Time": "30 minutes",
    "url": "https://i.ytimg.com/vi/qoHnwOHLiMk/maxresdefault.jpg",
    "id": 14
  },
  {
    "name": "Classic Bolognese Sauce",
    "description": "A rich and hearty Italian meat sauce made with ground beef, tomatoes, and aromatic vegetables, perfect for pasta dishes.",
    "author": "Chef Marco Rossi",
    "ingredients": [
      "2 tablespoons olive oil",
      "1 medium onion, finely chopped",
      "2 carrots, finely chopped",
      "2 celery stalks, finely chopped",
      "4 garlic cloves, minced",
      "1 pound ground beef",
      "1 pound ground pork",
      "1 cup whole milk",
      "1 cup dry white wine",
      "2 cans (28 ounces each) crushed tomatoes",
      "2 tablespoons tomato paste",
      "1 teaspoon dried oregano",
      "1 teaspoon dried basil",
      "1 bay leaf",
      "Salt and pepper to taste",
      "1/2 cup grated Parmesan cheese (optional, for serving)"
    ],
    "instructions": [
      "Step 1: Heat olive oil in a large pot or Dutch oven over medium heat. Add the chopped onion, carrots, and celery. Cook for 5-7 minutes, stirring occasionally, until the vegetables are softened.",
      "Step 2: Add the minced garlic and cook for another 1-2 minutes until fragrant. Be careful not to burn the garlic.",
      "Step 3: Increase the heat to medium-high and add the ground beef and pork. Cook, breaking up the meat with a spoon, until browned and no longer pink, about 8-10 minutes.",
      "Step 4: Pour in the milk and stir to combine. Let it simmer until the milk is mostly absorbed, about 5 minutes. This step helps tenderize the meat and adds richness to the sauce.",
      "Step 5: Add the white wine and cook until the liquid is reduced by half, about 5 minutes. Stir in the crushed tomatoes, tomato paste, oregano, basil, bay leaf, salt, and pepper.",
      "Step 6: Reduce the heat to low and let the sauce simmer uncovered for 1.5 to 2 hours, stirring occasionally. The sauce should thicken and develop a deep flavor.",
      "Step 7: Remove the bay leaf and taste the sauce. Adjust seasoning with salt and pepper if needed. Serve over cooked pasta and sprinkle with grated Parmesan cheese if desired."
    ],
    "servings": 6,
    "calories": 450,
    "carbs": 20,
    "fats": 25,
    "proteins": 35,
    "Time": "2 hours 30 minutes",
    "url": "https://i.ytimg.com/vi/V5WR-K0zJYs/maxresdefault.jpg",
    "id": 15
  },
  {
    "name": "The Creamiest Cheesecake",
    "description": "A rich and creamy cheesecake with a buttery graham cracker crust, perfect for any occasion.",
    "author": "Chef John",
    "ingredients": [
      "1 1/2 cups graham cracker crumbs",
      "1/4 cup granulated sugar",
      "6 tablespoons unsalted butter, melted",
      "4 (8-ounce) packages cream cheese, softened",
      "1 1/4 cups granulated sugar",
      "1 teaspoon vanilla extract",
      "4 large eggs",
      "2/3 cup sour cream",
      "2/3 cup heavy cream"
    ],
    "instructions": [
      "Step 1: Preheat your oven to 325°F (163°C). In a medium bowl, combine the graham cracker crumbs, 1/4 cup sugar, and melted butter. Mix until the crumbs are evenly moistened.",
      "Step 2: Press the crumb mixture firmly into the bottom of a 9-inch springform pan. Use the bottom of a glass or a measuring cup to press the crumbs down evenly. Bake the crust for 10 minutes, then remove from the oven and let it cool.",
      "Step 3: In a large mixing bowl, beat the softened cream cheese on medium speed until smooth and creamy. Gradually add 1 1/4 cups sugar and continue to beat until well combined. Add the vanilla extract and mix until incorporated.",
      "Step 4: Add the eggs one at a time, beating well after each addition. Make sure to scrape down the sides of the bowl to ensure everything is evenly mixed. Finally, add the sour cream and heavy cream, and mix until the batter is smooth and creamy.",
      "Step 5: Pour the cheesecake batter over the cooled crust. Smooth the top with a spatula. Place the springform pan in a larger baking dish and fill the dish with hot water until it reaches halfway up the sides of the springform pan. This water bath will help prevent cracks.",
      "Step 6: Bake the cheesecake in the preheated oven for about 1 hour and 15 minutes, or until the edges are set but the center still jiggles slightly. Turn off the oven and leave the cheesecake inside with the door slightly open for 1 hour.",
      "Step 7: Remove the cheesecake from the oven and let it cool completely at room temperature. Once cooled, refrigerate for at least 4 hours, or preferably overnight, before serving."
    ],
    "servings": 12,
    "calories": 520,
    "carbs": 35,
    "fats": 38,
    "proteins": 8,
    "Time": "1 hour 45 minutes",
    "url": "https://i.ytimg.com/vi/Ov4u0ARMWKQ/maxresdefault.jpg",
    "id": 16
  },
  {
    "name": "The Creamiest Cheesecake",
    "description": "A rich and velvety cheesecake with a smooth texture and a buttery graham cracker crust.",
    "author": "Chef Emily Carter",
    "ingredients": [
      "2 cups graham cracker crumbs",
      "1/2 cup unsalted butter, melted",
      "1/4 cup granulated sugar",
      "4 (8 oz) packages cream cheese, softened",
      "1 1/4 cups granulated sugar",
      "1 tsp vanilla extract",
      "4 large eggs",
      "1/2 cup sour cream",
      "1/2 cup heavy cream"
    ],
    "instructions": [
      "Step 1: Preheat your oven to 325°F (163°C). In a medium bowl, mix the graham cracker crumbs, melted butter, and 1/4 cup sugar until well combined. Press the mixture firmly into the bottom of a 9-inch springform pan to form the crust.",
      "Step 2: In a large mixing bowl, beat the softened cream cheese until smooth and creamy. Gradually add 1 1/4 cups sugar and continue to beat until fully incorporated.",
      "Step 3: Add the vanilla extract and beat until combined. Add the eggs one at a time, beating well after each addition. Make sure to scrape down the sides of the bowl to ensure even mixing.",
      "Step 4: Mix in the sour cream and heavy cream until the batter is smooth and uniform. Pour the cheesecake batter over the prepared crust in the springform pan.",
      "Step 5: Place the springform pan in a larger baking dish and fill the dish with hot water until it reaches halfway up the sides of the springform pan. This water bath will help prevent cracks in the cheesecake.",
      "Step 6: Bake in the preheated oven for 60-70 minutes, or until the edges are set but the center still has a slight jiggle. Turn off the oven and let the cheesecake cool in the oven with the door slightly open for 1 hour.",
      "Step 7: Remove the cheesecake from the oven and let it cool completely at room temperature. Once cooled, refrigerate for at least 4 hours or overnight before serving."
    ],
    "servings": 12,
    "calories": 450,
    "carbs": 30,
    "fats": 35,
    "proteins": 8,
    "Time": "1 hour 30 minutes",
    "url": "https://i.ytimg.com/vi/Ov4u0ARMWKQ/maxresdefault.jpg",
    "id": 17
  },
  {
    "name": "Classic Bolognese Sauce",
    "description": "A rich and hearty Italian meat sauce made with ground beef, tomatoes, and aromatic vegetables, perfect for pasta dishes.",
    "author": "Jamie Oliver",
    "ingredients": [
      "2 tablespoons olive oil",
      "1 large onion, finely chopped",
      "2 carrots, finely chopped",
      "2 celery stalks, finely chopped",
      "4 garlic cloves, minced",
      "1 pound ground beef",
      "1 pound ground pork",
      "1 cup whole milk",
      "1 cup dry white wine",
      "2 cans (28 ounces each) crushed tomatoes",
      "2 tablespoons tomato paste",
      "1 teaspoon dried oregano",
      "1 teaspoon dried basil",
      "1 bay leaf",
      "Salt and pepper to taste",
      "1/2 cup grated Parmesan cheese",
      "Fresh basil leaves for garnish"
    ],
    "instructions": [
      "Step 1: Heat the olive oil in a large pot over medium heat. Add the chopped onion, carrots, and celery, and cook until softened, about 8-10 minutes.",
      "Step 2: Add the minced garlic and cook for another 1-2 minutes until fragrant.",
      "Step 3: Increase the heat to medium-high and add the ground beef and pork. Cook until browned, breaking it up with a spoon, about 8-10 minutes.",
      "Step 4: Pour in the milk and stir well. Let it simmer until the milk is mostly absorbed, about 5 minutes.",
      "Step 5: Add the white wine and cook until it has reduced by half, about 5 minutes.",
      "Step 6: Stir in the crushed tomatoes, tomato paste, oregano, basil, bay leaf, salt, and pepper. Bring to a simmer, then reduce the heat to low and let it cook for at least 1 hour, stirring occasionally.",
      "Step 7: Remove the bay leaf and stir in the grated Parmesan cheese. Adjust seasoning if needed.",
      "Step 8: Serve the Bolognese sauce over cooked pasta, garnished with fresh basil leaves."
    ],
    "servings": 6,
    "calories": 450,
    "carbs": 20,
    "fats": 25,
    "proteins": 30,
    "Time": "1 hour 30 minutes",
    "url": "https://i.ytimg.com/vi/V5WR-K0zJYs/maxresdefault.jpg",
    "id": 18
  },
  {
    "name": "Classic Bolognese Sauce",
    "description": "A rich and hearty Italian meat sauce made with ground beef, tomatoes, and aromatic vegetables, perfect for pasta dishes.",
    "author": "Jamie Oliver",
    "ingredients": [
      "2 tablespoons olive oil",
      "1 large onion, finely chopped",
      "2 carrots, finely chopped",
      "2 celery stalks, finely chopped",
      "4 garlic cloves, minced",
      "1 pound ground beef",
      "1 pound ground pork",
      "1 cup whole milk",
      "1 cup dry white wine",
      "2 cans (28 ounces each) crushed tomatoes",
      "2 tablespoons tomato paste",
      "1 teaspoon dried oregano",
      "1 teaspoon dried basil",
      "1 bay leaf",
      "Salt and pepper to taste",
      "1/2 cup grated Parmesan cheese",
      "Fresh basil leaves for garnish"
    ],
    "instructions": [
      "Step 1: Heat the olive oil in a large pot over medium heat. Add the chopped onion, carrots, and celery. Cook for about 5-7 minutes until the vegetables are softened.",
      "Step 2: Add the minced garlic and cook for another minute until fragrant. Then, add the ground beef and pork. Cook until the meat is browned, breaking it up with a spoon as it cooks.",
      "Step 3: Pour in the milk and stir well. Let it simmer until the milk is mostly absorbed, about 5 minutes. This step helps to tenderize the meat.",
      "Step 4: Add the white wine and let it simmer until reduced by half, about 5 minutes. Stir in the crushed tomatoes, tomato paste, oregano, basil, and bay leaf. Season with salt and pepper.",
      "Step 5: Reduce the heat to low and let the sauce simmer uncovered for at least 1 hour, stirring occasionally. The longer it simmers, the more flavorful it will become.",
      "Step 6: Remove the bay leaf and stir in the grated Parmesan cheese. Taste and adjust seasoning if necessary.",
      "Step 7: Serve the Bolognese sauce over your favorite pasta, garnished with fresh basil leaves."
    ],
    "servings": 6,
    "calories": 450,
    "carbs": 20,
    "fats": 25,
    "proteins": 30,
    "Time": "1 hour 30 minutes",
    "url": "https://i.ytimg.com/vi/V5WR-K0zJYs/maxresdefault.jpg",
    "id": 19
  },
  {
    "name": "Classic Bolognese Sauce",
    "description": "A rich and hearty Italian meat sauce made with ground beef, tomatoes, and aromatic vegetables, perfect for pasta dishes.",
    "author": "Jamie Oliver",
    "ingredients": [
      "2 tablespoons olive oil",
      "1 large onion, finely chopped",
      "2 carrots, finely chopped",
      "2 celery stalks, finely chopped",
      "4 garlic cloves, minced",
      "1 pound ground beef",
      "1 pound ground pork",
      "1 cup whole milk",
      "1 cup dry white wine",
      "2 cans (28 ounces each) crushed tomatoes",
      "2 tablespoons tomato paste",
      "1 teaspoon dried oregano",
      "1 teaspoon dried basil",
      "1 bay leaf",
      "Salt and pepper to taste",
      "1/2 cup grated Parmesan cheese",
      "Fresh basil leaves for garnish"
    ],
    "instructions": [
      "Step 1: Heat the olive oil in a large pot over medium heat. Add the chopped onion, carrots, and celery. Cook for about 5-7 minutes until the vegetables are softened.",
      "Step 2: Add the minced garlic and cook for another 1-2 minutes until fragrant. Stir frequently to prevent burning.",
      "Step 3: Increase the heat to medium-high and add the ground beef and pork. Cook until the meat is browned, breaking it up with a spoon as it cooks. This should take about 8-10 minutes.",
      "Step 4: Pour in the milk and stir well. Let it simmer until the milk is mostly absorbed, about 5 minutes. This step helps to tenderize the meat.",
      "Step 5: Add the white wine and let it simmer until reduced by half, about 5 minutes. Stir occasionally.",
      "Step 6: Stir in the crushed tomatoes, tomato paste, oregano, basil, and bay leaf. Season with salt and pepper to taste. Bring the sauce to a gentle simmer.",
      "Step 7: Reduce the heat to low and let the sauce simmer uncovered for at least 1 hour, stirring occasionally. The longer it simmers, the more flavorful it will become.",
      "Step 8: Remove the bay leaf and stir in the grated Parmesan cheese. Adjust seasoning if necessary.",
      "Step 9: Serve the Bolognese sauce over cooked pasta of your choice. Garnish with fresh basil leaves and additional Parmesan cheese if desired."
    ],
    "servings": 6,
    "calories": 450,
    "carbs": 20,
    "fats": 25,
    "proteins": 35,
    "Time": "1 hour 30 minutes",
    "url": "https://i.ytimg.com/vi/V5WR-K0zJYs/maxresdefault.jpg",
    "id": 20
  },
  {
    "name": "Chicken Biryani",
    "description": "Aromatic and flavorful rice dish layered with marinated chicken, fragrant spices, and basmati rice, cooked to perfection.",
    "author": "Chef Ramesh",
    "ingredients": [
      "500g chicken (cut into pieces)",
      "2 cups basmati rice",
      "4 cups water",
      "1 large onion (thinly sliced)",
      "2 tomatoes (chopped)",
      "1 cup plain yogurt",
      "2 tbsp ginger-garlic paste",
      "1/2 cup cooking oil",
      "1/4 cup ghee (clarified butter)",
      "2-3 green chilies (slit)",
      "1/2 cup fresh coriander leaves (chopped)",
      "1/2 cup fresh mint leaves (chopped)",
      "1 tsp turmeric powder",
      "1 tbsp red chili powder",
      "1 tbsp garam masala",
      "2-3 bay leaves",
      "4-5 cloves",
      "2-3 cardamom pods",
      "1 cinnamon stick",
      "1 tsp cumin seeds",
      "Salt to taste"
    ],
    "instructions": [
      "Step 1: Wash the basmati rice thoroughly and soak it in water for 30 minutes. Drain and set aside.",
      "Step 2: In a large bowl, marinate the chicken with yogurt, ginger-garlic paste, turmeric powder, red chili powder, garam masala, and salt. Mix well and let it marinate for at least 1 hour.",
      "Step 3: Heat oil and ghee in a large pot. Add bay leaves, cloves, cardamom pods, cinnamon stick, and cumin seeds. Sauté until fragrant.",
      "Step 4: Add the sliced onions and cook until golden brown. Then, add the marinated chicken and cook for 10-12 minutes until the chicken is partially cooked.",
      "Step 5: Add the chopped tomatoes, green chilies, coriander leaves, and mint leaves. Cook for another 5 minutes until the tomatoes are soft.",
      "Step 6: Layer the partially cooked chicken mixture with the soaked and drained rice in the pot. Add 4 cups of water and gently mix without breaking the rice grains.",
      "Step 7: Cover the pot with a tight-fitting lid and cook on low heat for 20-25 minutes until the rice is fully cooked and the flavors are well combined.",
      "Step 8: Turn off the heat and let the biryani rest for 10 minutes before serving. Fluff the rice gently with a fork and serve hot."
    ],
    "servings": 4,
    "calories": 650,
    "carbs": 75,
    "fats": 25,
    "proteins": 35,
    "Time": "1 hour 30 minutes",
    "url": "https://i.ytimg.com/vi/6XlMguO9r-M/maxresdefault.jpg",
    "id": 21
  },
  {
    "name": "Classic Bolognese Sauce",
    "description": "A rich and hearty Italian meat sauce made with ground beef, tomatoes, and aromatic vegetables, perfect for pasta dishes.",
    "author": "Chef Marco Rossi",
    "ingredients": [
      "2 tablespoons olive oil",
      "1 medium onion, finely chopped",
      "2 carrots, finely chopped",
      "2 celery stalks, finely chopped",
      "4 cloves garlic, minced",
      "1 pound ground beef",
      "1/2 pound ground pork",
      "1 cup whole milk",
      "1 cup dry white wine",
      "2 cans (28 ounces each) crushed tomatoes",
      "2 tablespoons tomato paste",
      "1 teaspoon dried oregano",
      "1 teaspoon dried basil",
      "1/2 teaspoon red pepper flakes (optional)",
      "Salt and black pepper to taste",
      "1/2 cup grated Parmesan cheese",
      "1/4 cup chopped fresh parsley"
    ],
    "instructions": [
      "Step 1: Heat olive oil in a large pot or Dutch oven over medium heat. Add the chopped onion, carrots, and celery. Cook, stirring occasionally, until the vegetables are softened, about 8-10 minutes.",
      "Step 2: Add the minced garlic and cook for another 1-2 minutes until fragrant. Then, add the ground beef and ground pork. Cook, breaking up the meat with a spoon, until browned and cooked through, about 8-10 minutes.",
      "Step 3: Pour in the milk and stir to combine. Let it simmer until the milk is mostly absorbed, about 5 minutes. This step helps tenderize the meat and adds richness to the sauce.",
      "Step 4: Add the white wine and cook until it has mostly evaporated, about 5 minutes. Stir in the crushed tomatoes, tomato paste, oregano, basil, red pepper flakes (if using), salt, and black pepper. Bring the sauce to a gentle simmer.",
      "Step 5: Reduce the heat to low and let the sauce simmer uncovered for at least 1 hour, stirring occasionally. The longer it simmers, the more flavorful it will become. If the sauce gets too thick, add a splash of water or broth.",
      "Step 6: Stir in the grated Parmesan cheese and chopped parsley just before serving. Taste and adjust seasoning if needed. Serve over your favorite pasta and enjoy!"
    ],
    "servings": 6,
    "calories": 420,
    "carbs": 18,
    "fats": 28,
    "proteins": 24,
    "Time": "1 hour 30 minutes",
    "url": "https://i.ytimg.com/vi/V5WR-K0zJYs/maxresdefault.jpg",
    "id": 22
  },
  {
    "name": "The Creamiest Cheesecake",
    "description": "A rich and velvety cheesecake with a smooth texture and a buttery graham cracker crust.",
    "author": "Chef Emily Carter",
    "ingredients": [
      "1 1/2 cups graham cracker crumbs",
      "1/4 cup granulated sugar",
      "1/2 cup unsalted butter, melted",
      "4 (8 oz) packages cream cheese, softened",
      "1 1/4 cups granulated sugar",
      "1/2 cup sour cream",
      "2 teaspoons vanilla extract",
      "3 large eggs",
      "1/4 cup all-purpose flour",
      "1/4 cup heavy cream"
    ],
    "instructions": [
      "Step 1: Preheat your oven to 325°F (163°C). Grease a 9-inch springform pan and set aside.",
      "Step 2: In a medium bowl, combine the graham cracker crumbs, 1/4 cup sugar, and melted butter. Press the mixture firmly into the bottom of the prepared pan to form the crust. Bake for 10 minutes, then remove and let cool.",
      "Step 3: In a large mixing bowl, beat the softened cream cheese and 1 1/4 cups sugar until smooth and creamy. Add the sour cream and vanilla extract, and mix until well combined.",
      "Step 4: Add the eggs one at a time, beating well after each addition. Gradually mix in the flour and heavy cream until the batter is smooth and free of lumps.",
      "Step 5: Pour the cheesecake batter over the cooled crust. Smooth the top with a spatula. Bake in the preheated oven for 50-60 minutes, or until the edges are set but the center still jiggles slightly.",
      "Step 6: Turn off the oven and let the cheesecake cool in the oven with the door slightly open for 1 hour. Then, refrigerate for at least 4 hours or overnight before serving."
    ],
    "servings": 12,
    "calories": 450,
    "carbs": 35,
    "fats": 32,
    "proteins": 7,
    "Time": "1 hour 30 minutes (plus chilling time)",
    "url": "https://i.ytimg.com/vi/Ov4u0ARMWKQ/maxresdefault.jpg",
    "id": 23
  },
  {
    "name": "The Creamiest Cheesecake",
    "description": "A rich and velvety cheesecake with a smooth texture and a buttery graham cracker crust.",
    "author": "Professional Chef",
    "ingredients": [
      "1 1/2 cups graham cracker crumbs",
      "1/4 cup granulated sugar",
      "1/2 cup unsalted butter, melted",
      "4 (8 oz) packages cream cheese, softened",
      "1 1/4 cups granulated sugar",
      "1 tsp vanilla extract",
      "4 large eggs",
      "1/2 cup sour cream",
      "1/2 cup heavy cream"
    ],
    "instructions": [
      "Step 1: Preheat your oven to 325°F (163°C). Grease a 9-inch springform pan and set aside.",
      "Step 2: In a medium bowl, combine the graham cracker crumbs, 1/4 cup sugar, and melted butter. Mix until the crumbs are evenly moistened. Press the mixture firmly into the bottom of the prepared springform pan to form the crust. Bake for 10 minutes, then remove from the oven and let cool.",
      "Step 3: In a large mixing bowl, beat the softened cream cheese on medium speed until smooth and creamy. Gradually add 1 1/4 cups sugar and continue beating until well combined. Mix in the vanilla extract.",
      "Step 4: Add the eggs one at a time, beating well after each addition. Scrape down the sides of the bowl as needed. Mix in the sour cream and heavy cream until the batter is smooth and fully incorporated.",
      "Step 5: Pour the cheesecake batter over the cooled crust. Smooth the top with a spatula. Place the springform pan in a larger baking dish and fill the dish with hot water until it reaches halfway up the sides of the springform pan to create a water bath.",
      "Step 6: Bake in the preheated oven for 60-70 minutes, or until the edges are set but the center still jiggles slightly. Turn off the oven, crack the door open, and let the cheesecake cool in the oven for 1 hour.",
      "Step 7: Remove the cheesecake from the oven and water bath. Run a knife around the edges to loosen it from the pan. Let it cool completely at room temperature, then refrigerate for at least 4 hours or overnight before serving."
    ],
    "servings": 12,
    "calories": 450,
    "carbs": 30,
    "fats": 34,
    "proteins": 7,
    "Time": "1 hour 30 minutes (plus chilling time)",
    "url": "https://i.ytimg.com/vi/Ov4u0ARMWKQ/maxresdefault.jpg",
    "id": 24
  },
  {
    "name": "The Creamiest Cheesecake",
    "description": "A rich and velvety cheesecake with a smooth texture and a buttery graham cracker crust.",
    "author": "Chef John",
    "ingredients": [
      "1 1/2 cups graham cracker crumbs",
      "1/4 cup granulated sugar",
      "6 tablespoons unsalted butter, melted",
      "4 (8-ounce) packages cream cheese, softened",
      "1 1/4 cups granulated sugar",
      "1 teaspoon vanilla extract",
      "4 large eggs",
      "2/3 cup sour cream",
      "2/3 cup heavy cream"
    ],
    "instructions": [
      "Step 1: Preheat your oven to 325°F (163°C). Prepare a 9-inch springform pan by greasing the sides and lining the bottom with parchment paper.",
      "Step 2: In a medium bowl, combine the graham cracker crumbs, 1/4 cup sugar, and melted butter. Mix until the crumbs are evenly moistened. Press the mixture firmly into the bottom of the prepared pan to form the crust. Bake for 10 minutes, then set aside to cool.",
      "Step 3: In a large mixing bowl, beat the softened cream cheese on medium speed until smooth and creamy. Gradually add 1 1/4 cups sugar and continue beating until fully incorporated. Mix in the vanilla extract.",
      "Step 4: Add the eggs one at a time, beating well after each addition. Scrape down the sides of the bowl as needed. Gently fold in the sour cream and heavy cream until the mixture is smooth and uniform.",
      "Step 5: Pour the cheesecake filling over the cooled crust. Smooth the top with a spatula. Place the springform pan in a larger baking dish and fill the dish with hot water until it reaches halfway up the sides of the springform pan.",
      "Step 6: Bake in the preheated oven for 1 hour to 1 hour 15 minutes, or until the edges are set but the center still jiggles slightly. Turn off the oven, crack the door open, and let the cheesecake cool in the oven for 1 hour.",
      "Step 7: Remove the cheesecake from the oven and let it cool completely at room temperature. Refrigerate for at least 4 hours, or overnight, before serving."
    ],
    "servings": 12,
    "calories": 520,
    "carbs": 35,
    "fats": 38,
    "proteins": 8,
    "Time": "1 hour 45 minutes (plus chilling time)",
    "url": "https://i.ytimg.com/vi/Ov4u0ARMWKQ/maxresdefault.jpg",
    "id": 25
  },
  {
    "name": "The Creamiest Cheesecake",
    "description": "A rich and velvety cheesecake with a smooth texture and a buttery graham cracker crust.",
    "author": "Chef John",
    "ingredients": [
      "1 1/2 cups graham cracker crumbs",
      "1/4 cup granulated sugar",
      "6 tablespoons unsalted butter, melted",
      "4 (8-ounce) packages cream cheese, softened",
      "1 1/4 cups granulated sugar",
      "1 teaspoon vanilla extract",
      "4 large eggs",
      "2/3 cup sour cream",
      "2/3 cup heavy cream"
    ],
    "instructions": [
      "Step 1: Preheat your oven to 325°F (163°C). Grease a 9-inch springform pan and set aside.",
      "Step 2: In a medium bowl, combine the graham cracker crumbs, 1/4 cup sugar, and melted butter. Mix until the crumbs are evenly moistened. Press the mixture firmly into the bottom of the prepared pan to form the crust.",
      "Step 3: In a large mixing bowl, beat the softened cream cheese until smooth and creamy. Gradually add 1 1/4 cups sugar and continue beating until well combined. Mix in the vanilla extract.",
      "Step 4: Add the eggs one at a time, beating well after each addition. Ensure the mixture is smooth and free of lumps. Gently fold in the sour cream and heavy cream until fully incorporated.",
      "Step 5: Pour the cheesecake batter over the prepared crust. Smooth the top with a spatula. Place the pan in a larger baking dish and fill the dish with hot water until it reaches halfway up the sides of the springform pan.",
      "Step 6: Bake in the preheated oven for 1 hour and 15 minutes, or until the edges are set but the center still jiggles slightly. Turn off the oven, crack the door open, and let the cheesecake cool in the oven for 1 hour.",
      "Step 7: Remove the cheesecake from the oven and let it cool completely at room temperature. Refrigerate for at least 4 hours, or overnight, before serving."
    ],
    "servings": 12,
    "calories": 520,
    "carbs": 35,
    "fats": 38,
    "proteins": 8,
    "Time": "2 hours 30 minutes (plus chilling time)",
    "url": "https://i.ytimg.com/vi/Ov4u0ARMWKQ/maxresdefault.jpg",
    "id": 26
  },
  {
    "name": "The Creamiest Cheesecake",
    "description": "A rich and velvety cheesecake with a smooth texture and a buttery graham cracker crust.",
    "author": "Chef John",
    "ingredients": [
      "1 1/2 cups graham cracker crumbs",
      "1/4 cup granulated sugar",
      "6 tablespoons unsalted butter, melted",
      "4 (8-ounce) packages cream cheese, softened",
      "1 1/4 cups granulated sugar",
      "1 teaspoon vanilla extract",
      "4 large eggs",
      "2/3 cup sour cream",
      "2/3 cup heavy cream"
    ],
    "instructions": [
      "Step 1: Preheat your oven to 325°F (163°C). In a medium bowl, mix the graham cracker crumbs, 1/4 cup sugar, and melted butter until well combined. Press the mixture firmly into the bottom of a 9-inch springform pan to form the crust.",
      "Step 2: In a large mixing bowl, beat the softened cream cheese until smooth and creamy. Gradually add 1 1/4 cups sugar and continue to beat until fully incorporated.",
      "Step 3: Add the vanilla extract and beat until combined. Add the eggs one at a time, beating well after each addition. Make sure to scrape down the sides of the bowl to ensure even mixing.",
      "Step 4: Mix in the sour cream and heavy cream until the batter is smooth and uniform. Pour the cheesecake batter over the prepared crust in the springform pan.",
      "Step 5: Bake in the preheated oven for about 55-60 minutes, or until the edges are set but the center still has a slight jiggle. Turn off the oven and let the cheesecake cool in the oven with the door slightly open for 1 hour.",
      "Step 6: Remove the cheesecake from the oven and let it cool completely at room temperature. Once cooled, refrigerate for at least 4 hours or overnight before serving."
    ],
    "servings": 12,
    "calories": 520,
    "carbs": 35,
    "fats": 38,
    "proteins": 8,
    "Time": "1 hour 30 minutes",
    "url": "https://i.ytimg.com/vi/Ov4u0ARMWKQ/maxresdefault.jpg",
    "id": 27
  },
  {
    "name": "Chicken Biryani",
    "description": "Aromatic and flavorful rice dish layered with marinated chicken, fragrant spices, and basmati rice, cooked to perfection.",
    "author": "Unknown (Common recipe)",
    "ingredients": [
      "500g chicken (cut into pieces)",
      "2 cups basmati rice",
      "1 cup plain yogurt",
      "2 large onions (thinly sliced)",
      "2 tomatoes (chopped)",
      "4 cloves garlic (minced)",
      "1-inch ginger (minced)",
      "2 green chilies (slit)",
      "1/2 cup fresh coriander leaves (chopped)",
      "1/2 cup fresh mint leaves (chopped)",
      "1/2 cup cooking oil or ghee",
      "1/2 cup milk",
      "1/4 teaspoon saffron strands (soaked in 2 tablespoons warm milk)",
      "2 teaspoons biryani masala",
      "1 teaspoon turmeric powder",
      "1 teaspoon red chili powder",
      "1 teaspoon garam masala",
      "1 teaspoon cumin seeds",
      "4 cloves",
      "2 cardamom pods",
      "1 cinnamon stick",
      "2 bay leaves",
      "Salt to taste",
      "4 cups water"
    ],
    "instructions": [
      "Step 1: Wash the basmati rice thoroughly and soak it in water for 30 minutes. Drain and set aside.",
      "Step 2: In a large bowl, marinate the chicken with yogurt, ginger, garlic, green chilies, turmeric powder, red chili powder, biryani masala, and salt. Mix well and let it marinate for at least 1 hour.",
      "Step 3: Heat oil or ghee in a large pot. Add cumin seeds, cloves, cardamom pods, cinnamon stick, and bay leaves. Sauté until fragrant. Add sliced onions and fry until golden brown.",
      "Step 4: Add the marinated chicken to the pot and cook on medium heat for 10-12 minutes, stirring occasionally. Add chopped tomatoes and cook until they soften.",
      "Step 5: In a separate pot, boil 4 cups of water with a pinch of salt. Add the soaked and drained rice. Cook until the rice is 70% done. Drain and set aside.",
      "Step 6: Layer the partially cooked rice over the chicken in the pot. Sprinkle garam masala, chopped coriander, and mint leaves on top. Drizzle the saffron-infused milk over the rice.",
      "Step 7: Cover the pot with a tight-fitting lid and cook on low heat for 20-25 minutes (dum cooking). Do not stir during this process.",
      "Step 8: Once done, gently fluff the biryani with a fork, ensuring the layers remain intact. Serve hot with raita or salad."
    ],
    "servings": 4,
    "calories": 650,
    "carbs": 75,
    "fats": 25,
    "proteins": 35,
    "Time": "1 hour 30 minutes",
    "url": "https://i.ytimg.com/vi/6XlMguO9r-M/maxresdefault.jpg",
    "id": 28
  },
  {
    "name": "The Creamiest Cheesecake",
    "description": "A rich and velvety cheesecake with a smooth texture and a buttery graham cracker crust.",
    "author": "Professional Chef John Doe",
    "ingredients": [
      "2 cups graham cracker crumbs",
      "1/2 cup unsalted butter, melted",
      "1/4 cup granulated sugar",
      "4 (8 oz) packages cream cheese, softened",
      "1 1/4 cups granulated sugar",
      "1 tsp vanilla extract",
      "4 large eggs",
      "1/2 cup sour cream",
      "1/2 cup heavy cream"
    ],
    "instructions": [
      "Step 1: Preheat your oven to 325°F (163°C). Prepare a 9-inch springform pan by greasing the sides and lining the bottom with parchment paper.",
      "Step 2: In a medium bowl, mix the graham cracker crumbs, melted butter, and 1/4 cup sugar until well combined. Press the mixture firmly into the bottom of the prepared pan to form the crust. Bake for 10 minutes, then set aside to cool.",
      "Step 3: In a large mixing bowl, beat the softened cream cheese and 1 1/4 cups sugar on medium speed until smooth and creamy. Add the vanilla extract and mix until combined.",
      "Step 4: Add the eggs one at a time, beating well after each addition. Scrape down the sides of the bowl as needed. Mix in the sour cream and heavy cream until the batter is smooth and fully incorporated.",
      "Step 5: Pour the cheesecake batter over the cooled crust. Smooth the top with a spatula. Place the springform pan in a larger baking dish and fill the dish with hot water until it reaches halfway up the sides of the springform pan.",
      "Step 6: Bake in the preheated oven for 60-70 minutes, or until the edges are set but the center still jiggles slightly. Turn off the oven, crack the door open, and let the cheesecake cool in the oven for 1 hour.",
      "Step 7: Remove the cheesecake from the oven and let it cool completely at room temperature. Once cooled, refrigerate for at least 4 hours or overnight before serving."
    ],
    "servings": 12,
    "calories": 450,
    "carbs": 30,
    "fats": 34,
    "proteins": 8,
    "Time": "1 hour 30 minutes (plus chilling time)",
    "url": "https://i.ytimg.com/vi/Ov4u0ARMWKQ/maxresdefault.jpg",
    "id": 29
  }
]